var figureDeclaration = {
	stillLifes: {
		name: 'Натюрморты',
		descr: 'это такие фигуры, которые не меняются со временем. Их можно назвать осцилляторами периода 1.',
		members: {
			'hive': 'Улей (шесть клеток)',
			'aircraftcarrier': 'Авианосец (шесть клеток)',
			'block': '',
			'loaf': '',
			'boat': '',
			'tub': ''
		}
	},
	methuselahs: {
		name: 'Долгожители',
		descr: 'они состоят из небольшого числа клеток вначале, но долго меняются и стабилизируются только спустя много поколений.',
		members: {
			'acorn': 'Желудь (7 клеток)',
			'R-pentomino': 'R-пентомино (5 клеток)',
			'diehard': ''
		}
	},
	guns: {
		name: 'Ружья',
		descr: 'у них основная часть циклически повторяется, как у осцилляторов, но при этом периодически создаёт космические корабли, которые удаляются от ружья.',
		members: {
			'Gosper gun': 'Планерное ружьё Госпера'
		}
	},
	spaceships: {
		name: 'Космические корабли',
		descr: 'такие фигуры, которые повторяют свое начальное состояние с каким-то периодом, как и осцилляторы, но при этом они смещаются в сторону с некоторой скоростью. Максимальная возможная скорость называется "скоростью света" и равна одной клетке за поколение по горизонтали, вертикали или диагонали.',
		members: {
			'glider': 'Планер (5 клеток)'
		}
	},
	oscillators: {
		name: 'Осцилляторы',
		descr: 'это фигуры, которые повторяют свое начальное состояние каждые несколько поколений (с некоторым периодом), не смещаясь.',
		members: {
			'achimsp8': '',
			'achimsp4': '',
			'blinker': '',
			'beacon': '',
			'toad': '',
			'pentadecathlon': '',
			"Kok's galaxy": ''
		}
	},
	pufferTrainsAndRakes: {
		name: 'Паровозы и грабли',
		descr: 'паровозами называют фигуры, которые, как и космические корабли, движутся, повторяясь циклически, но при этом оставляют за собой обломки, которые через несколько поколений образуют натюрморт. Грабли - это подвид паровозов, с тем отличием, что их обломки являются космическими кораблями.',
		members: {
			//'': ''
		}
	},
	eatersAndReflectors: {
		name: 'Пожиратели и отражатели',
		descr: 'фигуры типа "пожиратель" могут пережить столкновение с некоторыми космическими кораблями и восстановить свою структуру. Корабль при этом будет уничтожен. Отражатели же могут изменять курс некоторых космических кораблей на 90 или 180 градусов, так же без повреждений для себя.',
		members: {
			'eater': 'Обычный пожиратель планеров (12 клеток)'
		}
	},
	other: {
		name: 'Другие',
		descr: 'фигуры, не вошедшие в остальные категории',
		members: {
			//'': ''
		}
	}
};

var collectFigures = function() {
	var figureDeclaration = this.figureDeclaration;
	//console.log(figureDeclaration);
	var list = document.getElementById('figure_list');
	for (var type in figureDeclaration) {
		var li = document.createElement('li');
		
		var name = figureDeclaration[type].name;
		var descr = figureDeclaration[type].descr;
		var header = document.createElement('h4');
		header.innerHTML = name;
		li.appendChild(header);
		var pDescr = document.createElement('p');
		pDescr.innerHTML = ' - '+descr;
		//pDescr.className = "tip";
		li.appendChild(pDescr);
		//console.log('dcscdsd');
		//console.log(name, descr);
		
		var members = figureDeclaration[type].members;
		for (var fig in members) {
			var figDescr = members[fig];

			var label = document.createElement('label');
			label.className = 'radio';
			var button = document.createElement('input');
			button.setAttribute('type', 'radio');
			button.setAttribute('name', 'figure');
			button.setAttribute('value', fig);
			button.setAttribute('onclick', 'figureSelectHandler(this.value)');
			label.appendChild(button);
			var div = document.createElement('div');
			div.className = 'radio__text';
			div.innerHTML = figDescr || fig;
			label.appendChild(div);
			li.appendChild(label);
			//console.log(fig, figDescr, label);
		}
		list.appendChild(li);
	}
};

var figures = {//фигуры видны, если смотреть по тройкам, но они отзеркалены и повернуты
"hive": [	[0,3,0],
		[3,0,3],
		[3,0,3],
		[0,3,0]
],
"aircraftcarrier": [	[3,3,0],
			[3,0,0],
			[0,0,3],
			[0,3,3]
],
"acorn": [		[0,0,3],
			[3,0,3],
			[0,0,0],
			[0,3,0],
			[0,0,3],
			[0,0,3],
			[0,0,3]
],
"R-pentomino": [	[0,3,0],
			[3,3,3],
			[3,0,0]
],
"Gosper gun": [		[0,0,0,0,0,3,3,0,0],
			[0,0,0,0,0,3,3,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,3,3,3,0,0],
			[0,0,0,3,0,0,0,3,0],
			[0,0,3,0,0,0,0,0,3],
			[0,0,0,3,0,0,0,3,0],
			[0,0,0,0,3,3,3,0,0],
			[0,0,0,0,3,3,3,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,3,3,3,0,0,0,0],
			[0,3,3,0,3,3,0,0,0],
			[0,3,3,0,3,3,0,0,0],
			[0,3,3,3,3,3,0,0,0],
			[3,3,0,0,0,3,3,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,3,3,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0,0,0],
			[0,0,0,3,3,0,0,0,0],
			[0,0,0,3,3,0,0,0,0]
],
"glider": [	[0,0,3],
		[3,0,3],
		[0,3,3]
],
"achimsp8": [	[0,3,0,0,0,0,0,0,0],
		[3,0,3,3,0,0,0,0,0],
		[3,0,0,0,0,3,0,0,0],
		[0,0,0,0,3,3,3,0,0],
		[0,0,0,0,0,0,0,0,0],
		[0,0,3,3,3,0,0,0,0],
		[0,0,0,3,0,0,0,0,3],
		[0,0,0,0,0,3,3,0,3],
		[0,0,0,0,0,0,0,3,0]
],
"achimsp4": [	[0,0,0,3,0,3,0,0,0],
		[0,3,3,3,0,3,3,3,0],
		[3,0,0,0,3,0,0,0,3],
		[3,0,3,0,0,0,3,0,3],
		[0,3,3,0,3,0,3,3,0],
		[0,0,0,0,0,0,0,0,0],
		[0,3,3,0,3,0,3,3,0],
		[3,0,3,0,0,0,3,0,3],
		[3,0,0,0,3,0,0,0,3],
		[0,3,3,3,0,3,3,3,0],
		[0,0,0,3,0,3,0,0,0]
],
"eater": [	[3,3,0,0,0,0],
		[3,3,0,0,0,0],
		[0,0,0,0,0,0],
		[0,0,0,0,0,0],
		[0,0,3,0,0,0],
		[0,3,0,3,0,0],
		[0,0,3,0,0,0],
		[0,0,0,3,3,3],
		[0,0,0,0,0,3]
],
"block":[	[3,3],
		[3,3]
],
"loaf":[	[0,3,0,0],
		[3,0,3,0],
		[3,0,0,3],
		[0,3,3,0]
],
"boat":[	[3,3,0],
		[3,0,3],
		[0,3,3]
],
"tub":[		[0,3,0],
		[3,0,3],
		[0,3,0]
],
"blinker":[	[3,3,3]
],
"toad":[	[0,3,3,0],
		[0,0,0,3],
		[3,0,0,0],
		[0,3,3,0]
],
"beacon":[	[3,3,0,0],
		[3,3,0,0],
		[0,0,3,3],
		[0,0,0,3]
],
"pentadecathlon":[	[0,3,0],
			[0,3,0],
			[3,0,3],
			[0,3,0],
			[0,3,0],
			[0,3,0],
			[0,3,0],
			[3,0,3],
			[0,3,0],
			[0,3,0]
],
"diehard":[	[0,3,0],
		[0,3,3],
		[0,0,0],
		[0,0,0],
		[0,0,0],
		[0,0,3],
		[3,0,3],
		[0,0,3]
],
"Kok's galaxy":[	[0,0,0,0,0,3,3,3,3,0,0],
			[0,3,3,0,3,0,0,0,0,3,0],
			[3,0,0,0,3,0,0,0,0,3,0],
			[3,0,0,0,0,3,3,0,0,0,0],
			[3,0,0,3,0,0,0,0,3,3,0],
			[3,0,0,3,0,0,0,3,0,0,3],
			[0,3,3,0,0,0,0,3,0,0,3],
			[0,0,0,0,3,3,0,0,0,0,3],
			[0,3,0,0,0,0,3,0,0,0,3],
			[0,3,0,0,0,0,3,0,3,3,0],
			[0,0,3,3,3,3,0,0,0,0,0]
]
};

var figuresTemp = {
eater2: [
	[0,2],
	[1,1],
	[1,3],
	[2,1],
	[2,3],
	[3,0],
	[3,1],
	[3,3],
	[3,4],
	[3,5],
	[4,6],
	[5,0],
	[5,1],
	[5,3],
	[5,4],
	[5,5],
	[6,0],
	[6,1],
	[6,3]
]
};
